backend-api/app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'elisa@admin.com'
 LIMIT 1
---
    public function login()
    {
        $model = new \App\Models\UserModel();

        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $user = $model->where('email', $email)->first();