backend-api/app/Controllers/Buku.php

SELECT `buku`.*, `kategori`.`nama_kategori`
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id` = `buku`.`id_kategori`
---
    public function index()
    {
        // KODE FINAL: Join tabel buku dengan kategori biar nama_kategori kebawa
        $data = $this->model->select('buku.*, kategori.nama_kategori')
                            ->join('kategori', 'kategori.id = buku.id_kategori', 'left')
                            ->findAll();