backend-api/app/Controllers/Peminjaman.php

    public function index()
    {
        // KODE FINAL: Join-nya sekarang ke tabel 'buku', bukan 'komik' lagi
        $data = $this->model->select('peminjaman.*, buku.judul AS judul_buku')
                            ->join('buku', 'buku.id = peminjaman.id_buku', 'left')
                            ->findAll();
---
SELECT `peminjaman`.*, `buku`.`judul` AS `judul_buku`
FROM `peminjaman`
LEFT JOIN `buku` ON `buku`.`id` = `peminjaman`.`id_buku`